/*
 * Прототип обєкта
 *
 * - https://miro.com/app/board/o9J_ku0WE0g=/
 * - Object.create()
 * - [[Prototype]] и __proto__
 * - Object.getPrototypeOf()
 * - Власні властивості і Object.prototype.hasOwnProperty()
 * - Цепочка прототипів
 */

/*
 * Алгоритм пошуку властивостей в цепочке прототипів:
 * 1. Пошук починається у власних властивостях
 * 2. Якщо властивості нема у власних, пошук переходить до цепочки прототипів
 * 3. Пошук припиняється при першому співпадінню (є така властивість)
 * 4. Повертається значення властивості
 */
