/*
 * Основи ООП: клас, єкземпляр (обєкт), інтерфейс
 */

/*
 * Функції-конструктори
 * - Найменування
 * - Оператор new
 * - Властивість Function.prototype
 */

// 1 Якщо функція визивається через new, тоді створюється новий обєкт
// 2. Функція визивается в контексті створеного обєкта,
//   //    тобто у this записується силка на нього
// 3. У властивість this.__proto__ записується силка на обєкт Car.prototype
//    тобто Car.prototype це ПРОТОТИП майбутнього обєкта (єкземпляра)
// 4. Силка на обєкт повертається на місце виклику new Car

//  brand: 'Audi',
//   model: 'A6',
//   price: 65000,

//   brand: 'BMW',
//   model: 'X6',
//   price: 50000,

//  brand: 'Audi',
//   model: 'Q6',
//   price: 65000,
